#include <stdio.h>
#include <stdlib.h>

int main()
{

    int matrix[10][20] = {{-233, -382, -261, -43, -376, -148, -38, -88, -25, -39, -376, -22,
                           -260, -36, -137, -285, -246, -301, -37, -257 - 316},
                          {-239, -49, -187, -349, -48, -243,
                           -139, 3, -394, -12, -158, -192, 40, -234, 11, -371, -158, -356, -203, 19},
                          {-198, -125,
                           -21, -220, -314, -50, -297, -22, 12, -354, 38, -289, -252, -242, -88, -4, -148, -351,
                           -323, -65},
                          {-148, -58, -162, -198, -224, 22, -371, -215, -131, 22, -79, -293, -173,
                           -308, -331, 34, -329, -94, 1, -336},
                          {42, -191, -249, -245, -217, -314, -314, -84, -353, // Заполнил матрицу используя https://rand.by/integer
                           -47, -219, -193, -327, -136, -377, -108, -332, 40, -214, -262},
                          {-104, -142, -236, -210,
                           -303, -181, -361, -284, -201, -248, -143, -136, -370, -19, -294, -341, -129, -304, -112,
                           -43},
                          {-392, -81, -71, -339, -5, -48, -23, -263, -324, -134, -112, -77, -382, -244, -208,
                           -322, -323, -340, -48, -73},
                          {49, -20, 5, -129, -272, -168, -303, -397, -43, -321, 6, -308,
                           -330, -89, -103, 14, -379, -299, -36, -18},
                          {-261, -398, -277, -340, -277, -146, -390, -149,
                           -218, -84, -365, -336, -221, -201, -302, -355, 20, -238, -227, -208},
                          {-133, -263, -1, -19,
                           -259, -186, -84, -170, -204, -236, -341, -145, -60, -233, -152, -262, -64, -108, -43}};

    int counter = 0;                                 // Счетчик количества четных чисел в строке
    int number[10] = {0, 0, 0, 0, 0, 0, 0, 0, 0, 0}; // Массив, в котором показано количесвто положительных чисел в строке

    printf("Given matrix:\n\n");
    for (int i = 0; i < 10; i++)
    {
        for (int j = 0; j < 20; j++)
            printf("%d ", matrix[i][j]); // Распечатал исходный массив
        printf("\n");
    }

    for (int i = 0; i != 10; ++i)
    {
        for (int j = 0; j != 20; ++j)
        {
            if (matrix[i][j] > 0)
            {
                ++counter;
            }
        }
        if (counter >= 2) // проверка на условие (>2 "+")
        {
            number[i] = counter; // формирование массива
        }
        counter = 0;
    }

    /*for (int i = 0; i != 10; ++i) // Распечатал массив с количеством положительных чисел
    {
        printf("%d ", number[i]);
    }*/

    int sumarr[10];
    int sum = 0;

    for (int i = 0; i != 10; ++i)
    {
        if (number[i] != 0)
        {
            for (int k = 0; k != 20; ++k)
            {
                sum += matrix[i][k];
            }
            sumarr[i] = sum;
            sum = 0;
        }
        else
        {
            sumarr[i] = 0;
        }
    }

    /*printf("\n\n");
    for (int i = 0; i != 10; ++i)
    {
        printf("%d ", sumarr[i]); // РАспечатал массив с суммами положительных строк
    }*/

    printf("\n\n");
    int max = INT_MIN;
    int line;
    for (int i = 0; i != 10; ++i)
    {
        if ((sumarr[i] > max) && (sumarr[i] != 0))
        {
            max = sumarr[i];
            line = i;
        }
    }

    printf("Num of line: %d\nSum of line: %d\n ", line + 1, max);

    return 0;
}